meshing/blockMesh_mesh/potential_flow_solution/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
9200
(
(0.74317 -2.39202 0)
(0.380912 -1.99216 0)
(0.227367 -1.72192 0)
(0.154488 -1.52466 0)
(0.115384 -1.37193 0)
(0.091841 -1.2484 0)
(0.0762445 -1.14521 0)
(0.065129 -1.05693 0)
...
)
;

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    constant (1 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    ellipse
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 0);
    }
    topAndBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
