meshing/blockMesh_mesh/potential_flow_solution/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
18090
(
0.0623124
-0.166429
0.0352964
-0.152505
0.0229664
-0.137329
0.0166213
-0.123882
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.128125
-0.128125
-0.128125
-0.128125
-0.128125
-0.128125
-0.128125
-0.128125
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
7.01513e-05
0.000210023
0.000348601
0.000485031
0.000618473
0.000748103
0.000873121
0.000992758
...
)
;
    }
    ellipse
    {
        type            calculated;
        value           uniform 0;
    }
    topAndBottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
380
(
0.232241
0.179521
0.149659
0.130228
0.116165
0.105212
0.0962538
0.0886821
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
