meshing/blockMesh_mesh/potential_flow_solution/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            wall;
        nFaces          40;
        startFace       18090;
    }
    outlet
    {
        type            wall;
        nFaces          40;
        startFace       18130;
    }
    ellipse
    {
        type            wall;
        nFaces          160;
        startFace       18170;
    }
    topAndBottom
    {
        type            wall;
        nFaces          380;
        startFace       18330;
    }
    frontAndBack
    {
        type            empty;
        nFaces          18400;
        startFace       18710;
    }
)

// ************************************************************************* //
